# (org-babel-load-file (buffer-file-name))

* 1 Start nREPL

#+begin_src emacs-lisp :noweb yes
  (require 'clomacs)
  (clomacs-defun get-property System/getProperty)
  (clomacs-with-nrepl nil
    (lambda ()
      (message "Running Java %s on %s system"
               (get-property "java.version")
               (get-property "os.arch"))))
#+end_src

#+RESULTS:
: Running Java 1.8.0_131 on amd64 system

* 2 Add clj-function

#+begin_src clojure
  (ns cm-test.core)
  (use 'clomacs)
  (defn add [x] (+ 1 x))
  (add 2)
#+end_src

#+RESULTS:
: nilnilnil#'cm-test.core/add3

* 3 Use clj-function in Emacs

#+begin_src emacs-lisp :noweb yes
  (require 'clomacs)
  (clomacs-defun cm-test-md-to-html-wrapper
                 my-md-to-html-string
                 :namespace cm-test.core)
  (clomacs-defun cm-test-add
                 add
                 :namespace cm-test.core)
  (clomacs-with-nrepl nil
    (lambda ()
      (message (cm-test-md-to-html-wrapper "# Hello, World %s times!")
               (cm-test-add 2))))
#+end_src

#+RESULTS:
: <h1>Hello, World 3 times!</h1>
